# GetGridNodeUV Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetGridNodeUV Method
DividedSurface Class See Also
---
Get the position of a grid node in UV coordinates in the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV GetGridNodeUV(
	GridNode gridNode
)
```

Visual Basic
---
```text
Public Function GetGridNodeUV ( _
	gridNode As GridNode _
) As UV
```

Visual C++
---
```text
public:
UV^ GetGridNodeUV(
	GridNode gridNode
)
```

# ### Parameters
gridNode
    Type: Autodesk.Revit.DB..::..GridNode
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ]. |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace